# -*- coding: utf-8 -*-

"""
Выведите первый и последний элемент списка.
"""

default_lst = ['one', 'two', 'three', 'four', 'five']

print(f'First element: {default_lst[0]}      Last element: {default_lst[-1]}')
