# -*- coding: utf-8 -*-


"""
Найдите три ключа с самыми высокими значениями в словаре 
my_dict = {'a':500, 'b':5874, 'c': 560,'d':400, 'e':5874, 'f': 20}.
"""

my_dict = {'a': 500, 'b': 5874, 'c': 560, 'd': 400, 'e': 5874, 'f': 20}

for k, v in my_dict.items():

    print(k, v)
