# -*- coding: utf-8 -*-

"""
Даны списки:
a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89];
b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13].
Нужно вернуть список, который состоит из элементов, общих для этих двух списков.
"""

list_a = [1, 1, 2, 3, 5, 8, 13, 21, 34, 55, 89]
list_b = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13]

set_a = set(list_a)
set_b = set(list_b)
list_c = list(set_a.intersection(set_b))
print(list_c)
# ------------------OR----------------------------
print(list(set(list_a).intersection(set(list_b))))
